app/views/questions/_question.html.erb

    <small class="text-muted">
    <% question.hashtags.each do |tag| %>
---
SELECT "hashtags".* FROM "hashtags" INNER JOIN "hashtag_questions" ON "hashtags"."id" = "hashtag_questions"."hashtag_id" WHERE "hashtag_questions"."question_id" = $1  [["question_id", 2]]