app/views/hashtags/show.html.erb

SELECT "questions".* FROM "questions" INNER JOIN "hashtag_questions" ON "questions"."id" = "hashtag_questions"."question_id" WHERE "hashtag_questions"."hashtag_id" = $1  [["hashtag_id", 1]]
---
  <div class="row row-cols-1">
      <% @hashtag.questions.each do |hashtag| %>