app/helpers/questions_helper.rb

SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."name" = $1 LIMIT $2  [["name", "question"], ["LIMIT", 1]]
---
  def text_with_hashtag_link(text)
    text.gsub(Hashtag::REGEXP_H).each do |ht|
      link_to ht, hashtag_path(Hashtag.find_by(name: ht.delete("#")))