app/controllers/hashtags_controller.rb

SELECT "hashtags".* FROM "hashtags" WHERE "hashtags"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @hashtag = Hashtag.find(params[:text])