app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    if @question.save
---
INSERT INTO "questions" ("text", "answer", "created_at", "updated_at", "user_id", "author_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "Hey man! What's up?\r\n#askme"], ["answer", nil], ["created_at", "2022-12-22 08:42:06.678863"], ["updated_at", "2022-12-22 08:42:06.678863"], ["user_id", 1], ["author_id", nil]]

  def update
    if @question.update(question_params)
---
UPDATE "questions" SET "answer" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["answer", "Fuck"], ["updated_at", "2022-11-26 07:13:12.984227"], ["id", 16]]

  def destroy
    user = @question.user
    @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 14]]

    def load_question
      @question = Question.find(params[:id])
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]