app/controllers/users_controller.rb

  def index
    @users = User.last(5)
    @hashtags = Hashtag.last(5)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 5]]
SELECT "hashtags".* FROM "hashtags" ORDER BY "hashtags"."id" DESC LIMIT $1  [["LIMIT", 5]]

  def create
    redirect_to root_url, alert: 'You already logged' if current_user.present?
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "username", "created_at", "updated_at", "email", "password_hash", "password_salt", "avatar_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    session[:user_id] = nil
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 10]]

  def update
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "avatar" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-12-31 10:01:41.844343"], ["avatar", "avatar.jpg"], ["id", 1]]

  def show
    @questions = @user.questions.order(created_at: :desc)
    @new_question = @user.questions.build

    @questions_count = @questions.count
    @answers_count = @questions.where.not(answer: nil).count
---
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = $1 AND "questions"."answer" IS NOT NULL  [["user_id", 1]]

  def questions
    @questions = @user.questions.order(created_at: :desc)
---
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ? ORDER BY "questions"."created_at" DESC  [["user_id", 1]]

  def specialists
    @users = User.all
---
SELECT "users".* FROM "users"

  def load_user
    @user ||= User.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]