app/models/question.rb

  def create_hashtags
    self.hashtags =
      "#{answer} #{text}".
        downcase.
        scan(Hashtag::REGEXP_H).
        uniq.
        map { |tag| Hashtag.find_or_create_by(name: tag.delete('#')) }
---
INSERT INTO "hashtags" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "friend"], ["created_at", "2022-12-24 14:07:32.809686"], ["updated_at", "2022-12-24 14:07:32.809686"]]
SELECT "hashtags".* FROM "hashtags" INNER JOIN "hashtag_questions" ON "hashtags"."id" = "hashtag_questions"."hashtag_id" WHERE "hashtag_questions"."question_id" = $1  [["question_id", 2]]