app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "joker"], ["LIMIT", 1]]
---
  def self.authenticate(email, password)
  user = find_by(email: email) || find_by(username: email)
  return nil unless user.present?

  hashed_password = User.hash_to_string(
    OpenSSL::PKCS5.pbkdf2_hmac(
      password, user.password_salt, ITERATIONS, DIGEST.length, DIGEST
    )
  )